package com.nyi.payahita.utils;

import com.nyi.payahita.data.vos.PlaceVO;

import java.util.ArrayList;
import java.util.List;

/**
 * Created by IN-3442 on 30-Jul-16.
 */
public class UploadDataUtils {

    public static List<PlaceVO> assignOrphanData(){
        List<PlaceVO> placeVOList = new ArrayList<>();

        placeVOList.add(new PlaceVO("မဟာေဗာဓိ YGWပရဟိတမိဘမဲ့ေက်ာင္း",
                "ရန္ကုန္တိုင္းေဒသႀကီး",
                "သနပ္ေခ်ာင္းေက်းရြာ၊ တိုက္ႀကီးၿမိဳ႕နယ္။ ",
                "09-796809759,09-797618643",
                " - ",
                "၈၂",
                "အဆိုပါေက်ာင္းသည္ရန္ကုန္ၿမိဳ႕မွျပည္ၿမိဳ႕ဘက္မွလာလွ်င္ တိုက္ၾကီးၿမိဳ႕အေက်ာ္ ဖလံ(ဥတိုတာဆံု)မွ ညာဘက္လမ္းခြဲသို႔ ၀င္ေရာက္ရၿပီး ၁၅မိနစ္ခန္႔ကားစီး၍ ၀င္ရေၾကာင္းသိရွိရပါသည္။"
                        +"မိုးတြင္းကာလတြင္ကားလမ္းမွာေျမသားလမ္းျဖစ္သျဖင့္ အနည္းငယ္အခက္အခဲရွိပါသည္။ ေက်ာင္းမွာယခုပညာသင္ႏွစ္မွစတင္၍ ကေလးငယ္မ်ားကိုပညာသင္ၾကားေပးမည္ျဖစ္ပါသည္။လ"
                        +"က္ရွိေက်ာင္းတြင္ရွမ္းျပည္နယ္နမ့္ခမ္းၿမိဳ႕နယ္ဘက္မွမိဘမဲ့ကေလး(၁၂)ဦးအပါအ၀င္ေက်ာင္းအိပ္ေက်ာင္းစားကေလးငယ္(၇၀)ေက်ာ္ကိုျပဳစုေစာင့္ေရွာက္ေကၽြးေမြးပညာ"
                        +"သင္ၾကားေပးလ်က္ရွိပါသည္။ပညာသင္ၾကားမႈအေနျဖင့္သူငယ္တန္းမွ၁၀တန္းအထိေက်ာင္းအိပ္ေက်ာင္းစားကေလးငယ္မ်ားအပါအ၀င္အနီးအနားရွိဆင္းရဲခ်ိဳ႕တဲ့ကေလးငယ္၁၈၀ေက်ာ္"
                        +"ကိုပါဆရာ၊ဆရာမ၁၅ဦးျဖင့္အခမဲ့ပညာသင္ၾကားေပးသြားမည္ျဖစ္ေၾကာင္းသိရွိရပါသည္။လက္ရွိတြင္ေက်ာင္းမွာအသစ္ျဖစ္ျခင္းေၾကာင့္လိုအပ္ခ်က္မ်ားစြာရွိေနပါသည္။ကေလး"
                        +"ငယ္မ်ားအတြက္အိပ္ေဆာင္မ်ား၊ထမင္းစားေဆာင္၊အ၀တ္အထည္မ်ား၊စာေရးကိရိယာမ်ား၊သင္ေထာက္ကူပစၥည္းမ်ားႏွင့္အမ်ိဳးသမီးအသံုးအေဆာင္ပစၥည္းမ်ားလည္းလိုအပ္လ်က္ရွိေနပါသည္။"
                        +"လက္ရွိတြင္ အမ်ိဳးသမီးငယ္(၃၅)ဦး ရွိပါသည္။"));

        placeVOList.add(new PlaceVO("မိုးညိဳ YGW ပရဟိတ မိဘမဲ့ေက်ာင္း",
                "ပဲခူးတိုင္းေဒသႀကီး",
                "မိုးညိဳၿမိဳ႕၊ ေအာင္ဆုပန္ဘုရားႀကီးအနီး၊ မိုးညိဳၿမိဳ႕နယ္။ ",
                "09-423749307,09-259472435",
                "၁သိန္း ၃ ေသာင္း",
                "၈၀",
                "အဆိုပါေက်ာင္းသည္ရန္ကုန္-ျပည္ကားလမ္းေပၚရွိမင္းလွၿမိဳ႕မွ မိုးညဳိၿမိဳ႕သို႔မိနစ္(၃၀)ခန္႔သြားေရာက္ရပါသည္။လမ္းပန္းဆက္သြယ္ေရးေကာင္းမြန္ပါသည္။ယခုႏွစ္ပညာ"
                        +"သင္ႏွစ္မွစတင္ကာရွမ္းျပည္နယ္၊နမ့္ခမ္းၿမိဳ႕နယ္ဘက္မွတုိင္းရင္းသားကေလးငယ္ေက်ာင္းအိပ္ေက်ာင္းစား(၈၀)ေက်ာ္ကိုေခၚယူေကၽြးေမြးေစာင့္ေရွာက္ပညာသင္ၾကား"
                        +"ေပးလ်က္ရွိပါသည္။ထို႔အျပင္အနီးအနားရွိဆင္းရဲခ်ိဳ႕တဲ့ကေလးငယ္မ်ားကိုလည္းေခၚယူပညာသင္ၾကားေပးလ်က္ရွိပါသည္။အာဟာရဒါနေကၽြးေမြးမႈအေနျဖင့္နံနက္စာအတြက္၃ေသာ"
                        +"င္းက်ပ္၊ေန႔လည္စာႏွင့္ညေနစာအတြက္က်ပ္၅ေသာင္းကုန္က်ၿပီးတစ္ေန႔တာအတြက္က်ပ္၁သိန္း၃ေသာင္းကုန္က်ေၾကာင္းသိရွိရပါသည္။ပရဟိတေက်ာင္းမွာအသစ္ေဆာက္လုပ္"
                        +"ေနဆဲျဖစ္သျဖင့္လိုအပ္ခ်က္မ်ားစြာရွိေနပါသည္။စာသင္ေဆာင္၊အိပ္ေဆာင္၊စာသင္ခံု၊ထမင္းစားပြဲ၊အိပ္ရာ၊ေစာင္၊ျခင္ေထာင္၊အ၀တ္အထည္မ်ား၊စာေရးကိ႐ိယာမ်ားႏွင့္ကေလးငယ္မ်ားေသာ"
                        +"က္သံုးရန္အတြက္ေရသန္႔စက္လိုအပ္လ်က္ရွိေနၿပီးဆရာ၊ဆရာမမ်ားအတြက္လစဥ္ေထာက္ပံ့မႈမ်ားလည္းလိုအပ္လ်က္ရွိေနေၾကာင္းဆရာေတာ္မွမိန္႔ၾကားခဲ့ပါသည္။မီးအလင္းေရာင္ရရွိ"
                        +"ေရးအတြက္ေန႔စဥ္ဒီဇယ္စက္ျဖင့္ည၆နာရီမွ၁၁နာရီအထိေမာင္းေပးေနရသျဖင့္ဒီဇယ္ဆီဖုိးမွာလည္း ေန႔စဥ္ကုန္က်လ်က္ရွိ ေနပါသည္။"));

        placeVOList.add(new PlaceVO("ေမတၱာရင္ခြင္ မိဘမဲ့ေက်ာင္း (ခရစ္ယာန္)",
                "ရန္ကုန္တိုင္းေဒသႀကီး",
                " အမွတ္ (၁၀၃၇)၊ သမာဓိ(၁)လမ္း၊ ည(၁၁)ရပ္ကြက္၊ ေရႊျပည္သာၿမိဳ႕နယ္၊ ( ေရႊယုန္ မွတ္တိုင္အနီး )။ ",
                "09-73091694,09-253338891",
                "၁သိန္း",
                "၅၀",
                "အဆိုပါမိဘမဲ့ေက်ာင္းတြင္ ကခ်င္၊ ကရင္၊ ခ်င္း၊ ရွမ္း၊ ပေလာင္ အစရွိေသာ တုိင္းရင္းသား မိဘမဲ့ ကေလးငယ္ ၅၀ ဦးကို ျပဳစုေစာင့္ေရွာက္ ေကၽြးေမြးထားပါသည္။ အသက္အား"
                        +"ျဖင့္ ၄ ႏွစ္မွ ၂၀ ႏွစ္၀န္းက်င္မ်ားျဖစ္ၾကၿပီး က်ား ၃၀ ဦး၊ မ ၂၀ ဦး ရွိေၾကာင္း သိရွိရပါသည္။ ပညာသင္ၾကားမႈအေနျဖင့္ အစိုးရေက်ာင္းမ်ားတြင္ ပညာသင္ၾကားေစလ်က္ရွိပါသည္။ "
                        +"ေက်ာင္းစရိတ္ကုန္က် ေငြမ်ားကို ဆရာမ မွ တာ၀န္ယူ ေျဖရွင္းေပးေနရေၾကာင္းသိရွိရပါသည္။ အာဟာရဒါနေကၽြးေမြးမႈအေနျဖင့္ တစ္ေန႔ ၃ ႀကိမ္ ေကၽြးေမြးပါသည္။ "
                        +"တစ္ေန႔တာအတြက္ က်ပ္ ၁ သိန္းခန္႔ ကုန္က်ေၾကာင္း သိရွိရပါသည္။ ကေလးငယ္မ်ားအတြက္ ေက်ာင္းစရိတ္မ်ား၊ အ၀တ္အထည္မ်ား၊ စာေရးကိရိယာမ်ား၊ အခင္း(ဖ်ာ/ေကာ္ေဇာ)"
                        +"မ်ား၊ ျခင္ေထာင္၊ ေစာင္မ်ားႏွင့္ ထမင္းေပါင္းအိုးမ်ား လိုအပ္လ်က္ရွိေနပါေၾကာင္းႏွင့္ ကေလးငယ္မ်ားႏွင့္ ပတ္သက္ၿပီး အခက္အခဲမ်ားစြာ ရွိေနပါေၾကာင္း ဆရာမမွ ေျပာၾကား"
                        +"ခဲ့ပါသည္။"));

        placeVOList.add(new PlaceVO("ေအာင္သုခ မိဘမဲ့ကေလးမ်ား ေစာင့္ေရွာက္ေရးေက်ာင္း",
                "မႏၱေလးတိုင္းေဒသႀကီး",
                "ရန္ကင္းေတာင္ေျမာက္ဘက္၊ ပုသိမ္ႀကီးၿမိဳ႕နယ္။ ",
                "09-43183453",
                " - ",
                "၂၀",
                "အဆိုပါေက်ာင္းကို ၂၀၁၄ ခုႏွစ္ေမလအတြင္းက စတင္ၿပီး ဖြင့္လွစ္ခဲ့ပါသည္။ ကခ်င္ျပည္နယ္ႏွင့္ ရွမ္းျပည္နယ္မ်ားရွိ မိဘမဲ့ကေလးငယ္ ၂၀ ဦးကို ေခၚယူေကၽြးေမြးေစာင့္ေရွာက္ "
                        +"ထားပါသည္။ အသက္အားျဖင့္ ၁၁ႏွစ္ႏွင့္အ ထက္ရွိေသာေယာက်္ားေလးမ်ားျဖစ္ၾကပါသည္။ပညာသင္ၾကားမႈပိုင္းအေနျဖင့္၅တန္းမွ၈တန္းအထိအတန္းပညာမ်ားကို"
                        +"အျခားဘုန္းေတာ္ႀကီးသင္ပညာေရးေက်ာင္းတြင္တက္ေရာက္ပညာသင္ၾကားေစလ်က္ရွိပါသည္။ဆက္လက္ၿပီးမိဘမဲ့ကေလးငယ္မ်ားကိုေခၚယူေမြးျမဴၿပီးအတန္းပညာမ်ားကိုသင္ၾ"
                        +"ကားေပးသြားမည္ျဖစ္ေၾကာင္းဆရာ ေတာ္မွမိန္႔ၾကားခဲ့ပါသည္။"));

        placeVOList.add(new PlaceVO("ေဇယ်ာသီရီ မိဘမဲ့အမ်ိဳးသမီးမ်ား ေဂဟာ",
                "ပဲခူးတိုင္းေဒသႀကီး",
                " (၂၂)ရပ္ကြက္၊ ၀က္ကုန္းလမ္း၊ ေတာင္ငူၿမိဳ႕၊ ။ ",
                " 09-428113994,054-23104",
                "၁သိန္း ၆ေသာင္း",
                "၇၀",
                "အဆိုပါေဂဟာတြင္ မိဘမဲ့အမ်ိဳးသမီးကေလးငယ္ ၇၀ ဦးကိုျပဳစုေစာင့္ေရွာက္ ေကၽြးေမြးထားရွိၿပီး အသက္အားျဖင့္ ၃ ႏွစ္မွ ၂၅ႏွစ္အထိျဖစ္ၾကပါသည္။ ပညာသင္ၾကားေပးမႈ"
                        +"အေနျဖင့္အစိုးရေက်ာင္းမ်ားတြင္သာတက္ေရာက္ပညာ သင္ၾကားေစလ်က္ရွိပါသည္။လက္ရွိတြင္ေတာင္ငူတကၠသိုလ္တြင္အေ၀းသင္တက္ေရာက္ေျဖဆိုေနၾကသည့္ေက်ာင္းသူေလးမ်ား"
                        +"လည္းရွိေၾကာင္းသိရွိရပါသည္။အာဟာရဒါနေကၽြးေမြးမႈအေနျဖင့္နံနက္ခင္းစာအတြက္က်ပ္၄ေသာင္း၊ေန႔လည္စာႏွင့္ညေနစာအတြက္က်ပ္၆ေသာင္းစီကုန္က်ေၾကာင္း"
                        +"ႏွင့္တစ္ေန႔တာအတြက္က်ပ္၁သိန္း၆ေသာင္းေက်ာ္ကုန္က်ေၾကာင္းသိရွိရပါသည္။ကေလးငယ္မ်ားအတြက္စားေသာက္ကုန္ပစၥည္းမ်ား၊အ၀တ္အထည္မ်ား၊စာေရးကိရိယာမ်ား၊အ"
                        +"တန္းႀကီးသို႔ တက္ေရာက္ေနၾကသည့္ ကေလးငယ္မ်ားအတြက္ ေက်ာင္းအသံုးစရိတ္မ်ား တြင္အခက္အခဲမ်ား ရွိေနေၾကာင္းသိရွိရပါသည္။"));


        placeVOList.add(new PlaceVO("ရတနာအလင္းေရာင္ မိဘမဲ့ကေလးမ်ား ေစာင့္ေရွာက္ေရးေက်ာင္း",
                "မႏၱေလးတိုင္းေဒသႀကီး",
                "လလ(၄၈)၊ ၅၈-လမ္း၊ စက္မႈ(၂)၊ ျပည္ႀကီးတံခြန္ၿမိဳ႕နယ္။ ",
                "09-402695999",
                "၂သိန္း ၂ေသာင္း",
                "၁၉၄",
                "လက္ရွိေက်ာင္းတြင္လသားအရြယ္(ႏို႔စို႔အရြယ္-၁၂ ဦး)မွ(၁၅)ႏွစ္အရြယ္ရွိ (ကိုရင္ -၂၇ပါး)အပါအ၀င္ ကေလးငယ္(၁၉၄)ဦးကို ေကၽြးေမြးေစာင့္ေရွာက္ထားပါ"
                        +"သည္။ ထို႔ျပင္အနီးအနားရွိကေလးငယ္(၂၁၀)ဦးကိုလည္းမူႀကိဳမွ၄တန္းအထိသင္ၾကား ေပးလ်က္ရွိၿပီး စုစုေပါင္းကေလးငယ္ (၄၁၄)ဦးကို အခမဲ့ပညာသင္ၾကား ေပးလ်က္ရွိပါသည္။"
                        +"အာဟာရေကၽြးေမြးမႈအေနျဖင့္နံနက္ခင္းစာ(၁၉၄)ဦးစာအတြက္က်ပ္၈ေသာင္းခြဲခန္႔ကုန္က်ၿပီးေန႔လည္စာ(၄၁၄)ဦးစာအတြက္က်ပ္၁သိန္း၇ေသာင္းခန္႔ကုန္က်၍ညေနစာ"
                        +"(၁၆၇)ဦးစာအတြက္၇ေသာင္းက်ပ္ခန္႔ကုန္က်ပါသည္။တစ္ေန႔တာကုန္က်မႈမွာက်ပ္၂သိန္း၂ေသာင္းက်ပ္ခန္႔ကုန္က်ပါသည္။စာေပသင္ၾကားေပးမႈအေနျဖင့္ဆရာ၊ဆရာမ(၁၄)ဦးမွ"
                        +"သင္ၾကားျပသေပးလ်က္ရွိပါသည္။လစဥ္ဆရာ၊ဆ ရာမမ်ားအတြက္ေထာက္ပံ့ေပးမႈမ်ားလည္းရွိပါသည္။ကေလးငယ္မ်ားအတြက္လိုအပ္ေနမႈမွာအ၀တ္အထည္မ်ား၊ဖိနပ္မ်ား(ဆိုဒ္စံု)၊စာေရးကိရိ"
                        +"ယာမ်ားႏွင့္စားေသာက္ကုန္ပစၥည္းမ်ားအထူးလိုအပ္လ်က္ရွိေၾကာင္းသိရွိရပါသည္။ပညာသင္ၾကားကေလးငယ္မ်ားႏွင့္ေက်ာင္းအိပ္ေက်ာင္းစားကေလးငယ္မ်ားပိုမိုမ်ားျပားလာသျဖင့္"
                        +"အေဆာက္အဦမ်ားႏွင့္စာသင္ေဆာင္မ်ားေဆာက္လုပ္ရန္ေျမေနရာလိုအပ္လ်က္ရွိပါသည္။ "));

        placeVOList.add(new PlaceVO("ဘုရားႀကီး မိဘမဲ့ကေလး ပရဟိတ ပညာေရးေက်ာင္း",
                "မႏၱေလးတိုင္းေဒသႀကီး",
                "တံတားဦးကုန္းေက်းရြာ၊ တံတားဦးၿမိဳ႕နယ္။ ( ရန္ကုန္ - မႏၱေလး အျမန္လမ္းမႀကီး၊ မိုင္တိုင္(၃၄၇)၊ ၃ ဖာလံု ၄ ဖာလံုၾကားတြင္ တည္ရွိပါသည္)",
                "09-33333374",
                "၁သိန္း ၇ေသာင္း",
                "၁၀၁",
                "အဆိုပါေက်ာင္းတြင္ တိုင္းရင္းသား မိဘမဲ့ကေလးငယ္ (ကိုရင္ ၂၀ ပါး အပါအ၀င္) (၁၀၀)ဦးကို ေက်ာင္းအိပ္ ေက်ာင္းစား မ်ား အျဖစ္ ေကၽြးေမြးေစာင့္ေရွာက္ထားရွိၿပီး မူလ"
                        +"တန္းမွ ၁၀ တန္းအထိ အတန္းပညာမ်ားကို သင္ၾကားေပးလ်က္ရွိပါသည္။ ေန႔စဥ္ အာဟာရေကၽြးေမြးမႈ (၃)ႀကိမ္ရွိၿပီး တစ္ေန႔တာအတြက္ ကုန္က်မႈမွာ က်ပ္ ၁ သိန္း ၇ ေသာင္း"
                        +"ခန္႔ ရွိေၾကာင္း သိရွိရပါသည္။ကေလးငယ္မ်ား စာသင္ၾကားႏိုင္ေရး စာသင္ခံုမ်ားႏွင့္ စာေရးကိရိယာမ်ား လိုအပ္လ်က္ရွိေနၿပီး ကေလးငယ္မ်ား အတြက္အ၀တ္အထည္အသံုးအေဆာင္ပစၥည္း"
                        +"မ်ားလည္းလိုအပ္လ်က္ရွိပါသည္။အဆိုပါေက်ာင္းကိုလူသိနည္းပါးသျဖင့္ကေလးငယ္မ်ားအတြက္ေနထိုင္စားေသာက္ေရးအခက္အခဲမ်ား ရွိေနပါသည္။"));

        placeVOList.add(new PlaceVO("ဧရိပ္မြန္(၂) အမ်ိဳးသမီးမိဘမဲ့ ျပဳစုေစာင့္ေရွာက္ေရးေက်ာင္း",
                "စစ္ကိုင္းတိုင္းေဒသႀကီး",
                "ဘူတာလမ္းခြဲ၊ ၿမိဳ႕သစ္ရပ္ကြက္၊ ေခ်ာင္းဦးၿမိဳ႕၊ ။ ",
                "071-45149",
                "၁သိန္း ၈ေသာင္း",
                "၁၀၅",
                "အဆိုပါ မိဘမဲ့ေက်ာင္းတြင္ ၁ ႏွစ္ခြဲအရြယ္မွ ၂၅ ေက်ာ္အထိ မိဘမဲ့ အမ်ိဳးသမီး ၁၀၅ ဦးကို လက္ရွိ ျပဳစုေစာင့္ေရွာက္ ပညာသင္ၾကားေပးလ်က္ရွိပါသည္။ အတန္းပညာမ်ားကို အစိုးရေက်ာင္းမ်ား"
                        +"တြင္ တက္ေရာက္ပညာသင္ၾကားေစ လ်က္ရွိပါသည္။ေန႔စဥ္ အာဟာရေကၽြးေမြးမႈအေနျဖင့္ ၃ ႀကိမ္ ေကၽြးေမြးၿပီး နံနက္ခင္းစာအတြက္ ၅ ေသာင္းက်ပ္၊ ေန႔လည္စာ အတြက္ ၈"
                        +" ေသာင္းက်ပ္ႏွင့္ ညေနစာအတြက္ ၅ ေသာင္းက်ပ္၊ တစ္ေန႔လွ်င္ ၁ သိန္း ၈ ေသာင္းခန္႔ ကုန္က်ေၾကာင္း သိရွိရပါသည္။ကေလးငယ္မ်ားအတြက္ အ၀တ္အထည္မ်ား၊ အမ်ိဳးသမီးအသံုးအေဆာင္မ်ား၊ "
                        +"ေန႔စဥ္ စားေသာက္ကုန္ပစၥည္းမ်ားႏွင့္ စာေရးကိရိယာမ်ား လိုအပ္လ်က္ရွိေၾကာင္း သိရွိရပါသည္။"));

        placeVOList.add(new PlaceVO("ရတနာေအာင္ျမင္ မိဘမဲ့ကေလးမ်ား ျပဳစုေစာင့္ေရွာက္ေရးေက်ာင္း",
                "မႏၱေလးၿမိဳ႕",
                " ၆၂ လမ္း၊ (စ)ရပ္ကြက္၊ စက္မႈဇံု(၁)အနီး၊ ဘံုပ်ံေတာရေက်ာင္းတိုက္၊ ျပည္ႀကီးတံခြန္ၿမိဳ႕နယ္။ ",
                "09-2051901",
                "၃သိန္း ၅ေသာင္း",
                "၂၃၈",
                "လက္ရွိေက်ာင္းတြင္မိဘမဲ့ကေလးငယ္(၂၃၈)ဦးရွိပါသည္။ အသက္အားျဖင့္ (၁၁)လသားအရြယ္ကေလးမွ(၂၀)ႏွစ္၀န္းက်င္ရွိကေလးငယ္မ်ားျဖစ္ၾကပါသည္။ကေလးငယ္မ်ားကိုေက်ာင္း"
                        +"တြင္ပညာသင္ၾကားေပးျခင္းမရွိဘဲအစိုးရေက်ာင္းမ်ားတြင္သာတက္ေရာက္ပညာသင္ၾကားေစလ်က္ရွိပါသည္။ကေလးမ်ားအတြက္အာဟာရေကၽြးေမြးမႈအေနျဖင့္နံနက္ခင္းစာအ"
                        +"တြက္က်ပ္၆ေသာင္း၊ေန႔လည္စာအတြက္က်ပ္၁သိန္း၇ေသာင္းခန္႔ကုန္က်ၿပီးညေနစာအတြက္၁သိန္း၂ေသာင္း၀န္းက်င္ကုန္က်ေၾကာင္းသိရွိရပါသည္။ကေလးငယ္မ်ားအတြက္"
                        +"အ၀တ္အထည္မ်ား၊စာေရးကိရိယာမ်ားႏွင့္ဆန္၊ဆီ၊ဆားအစရွိေသာစားေသာက္ကုန္ပစၥည္မ်ားလည္းလိုအပ္လ်က္ရွိပါသည္။ ထို႔ျပင္ကေလးငယ္မ်ားေနထိုင္ႏိုင္ရန္အတြက္၃ထပ္ေက်ာင္းေဆာင္သစ္ကို"
                        +"တည္ေဆာက္လ်က္ရွိရာအလွဴရွင္မ်ားလိုအပ္လ်က္ရွိပါသည္။"));

        placeVOList.add(new PlaceVO("ကေလးသူငယ္ ျပဳစုေစာင့္ေရွာက္ ျမွင့္တင္ေရး ေဂဟာ",
                "ရန္ကုန္တိုင္းေဒသႀကီး",
                "စံျပကြက္သစ္၊ ပတ္တန္းေက်းရြာအုပ္စု၊ ေမွာ္ဘီၿမိဳ႕နယ္။ ",
                "09-31310481",
                "၁သိန္း ၂ေသာင္း",
                "၆၀",
                "အဆိုပါ ေဂဟာကို ၁၉၉၈ ခုႏွစ္ ဧၿပီလ(၂၅)ရက္ေန႔တြင္ စတင္ တည္ေထာင္ခဲ့ျခင္းျဖစ္ၿပီး လက္ရိွေဂဟာတြင္ မိဘမဲ့ကေလးမ်ားႏွင့္ ဆင္းရဲခ်ိဳ႕တဲ့ကေလးငယ္ က်ား(၂၇)ဦးႏွင့္မ"
                        +"(၃၃)ဦး၊ စုစုေပါင္း(၆၀)ဦးကို ျပဳစုေကၽြးေမြး ေစာင့္ေရွာက္ပညာသင္ၾကားေပးလ်က္ရွိပါသည္။ ကေလးငယ္မ်ားကိုသူငယ္တန္းမွ၁၀တန္းအထိပညာသင္ၾကားေပးလ်က္ရွိပါသည္။"
                        +"ကေလးငယ္မ်ားကိုတစ္ေန႔လွ်င္အဟာရ(၃)ႀကိမ္ေကၽြးေမြးၿပီးနံနက္ခင္းစာအတြက္၃ေသာင္းက်ပ္၊ေန႔လည္စာအတြက္၅ေသာင္းက်ပ္ႏွင့္ညေနစာအတြက္၄ေသာင္း"
                        +"က်ပ္၊တစ္ေန႔တာအတြက္၁သိန္း၂ေသာင္းခန္႔ကုန္က်ေၾကာင္းသိရွိရပါသည္။ကေလးငယ္မ်ား၏ေန႔စဥ္စားေသာက္ေရးအတြက္လိုအပ္လ်က္ရွိသကဲ့သို႔အ၀တ္အထည္မ်ားလည္းလိုအပ္လ်က္ရွိ"
                        +"ေၾကာင္းသိရွိရပါသည္။ကေလးငယ္မ်ားကို၁၀တန္းအထိပညာသင္ၾကားေပးႏိုင္ေသာ္လည္းတကၠသိုလ္မ်ားသို႔ဆက္လက္တက္ေရာက္လိုသည့္ကေလးငယ္မ်ားအတြက္ဆက္လက္ထားေပးႏ"
                        +"ိုင္ေရးမွာအလြန္အခက္အခဲရွိေနေၾကာင္းသိရွိရပါသည္။ၿပီးခဲ့သည့္ပညာသင္ႏွစ္ကတကၠသိုလ္တန္း၀င္ကိုဂုဏ္ထူးမ်ားျဖင့္အမွတ္ေကာင္းေကာင္းေအာင္ျမင္ခဲ့သည့္မခိုင္မာလာထြန္းမွာ"
                        +"တကၠသိုလ္မ်ားသို႔ဆက္လက္တက္ေရာက္လိုသည့္အတြက္အခက္အခဲႏွင့္ႀကံဳေတြ႕ေနရေၾကာင္းသိရွိရပါသည္။မိဘမဲ့ကေလးငယ္မခိုင္မာလာထြန္းအတြက္ေက်ာင္းဆက္လက္တက္ေရာက္ႏ"
                        +"ုိင္ေရးေစတနာရွင္အလွဴရွင္မ်ားလိုအပ္ေနေၾကာင္းသိရွိရပါသည္။"));


        placeVOList.add(new PlaceVO("သခၤ႐ိုင္ ပရဟိတ မိဘမဲ့ ဘုန္းေတာ္ႀကီးသင္ ပညာေရးေက်ာင္း",
                "ပဲခူးတိုင္းေဒသႀကီး(အေနာက္ပိုင္း)",
                "သခၤ႐ိုင္ေက်းရြာ၊ ႐ုံးေခ်ာင္ေက်းရြာအုပ္စု၊ ႀကိဳ႕ပင္ေကာက္ၿမိဳ႕နယ္၊ သာယာ၀တီခ႐ိုင္၊ ",
                "09-43156632",
                " - ",
                "၂၂၃",
                "ၿမိဳ႕မွမိုင္(၂၀)ေ၀းကြာေသာပဲခူး႐ိုးမေတာင္ေျခရိွမိဘမဲ့ေက်ာင္းေလးျဖစ္ျပီးပြင့္လင္း ရာသီတြင္ပရဟိတအဖြဲ႕ေတြနဲ႔ အလွဴရွင္မ်ားအနည္းအပါး ေရာက္ေသာ္လည္း မိုးရာသီကာလ မ်ား"
                        +"တြင္သြားလာေရးခက္ခဲလြန္းေသာေၾကာင့္ အလွဴရွင္မ်ား မလာေရာက္ၾကပါ။မိဘမဲ့ကေလးငယ္လသားအရြယ္မွ၁၃ႏွစ္အရြယ္ထိ(၈၀)ဦးေက်ာ္ကိုေကၽြးေမြးေစာင့္ေရွာက္ထားၿပီးအနီးအနား"
                        +"၀န္းက်င္မွကေလးငယ္မ်ားစုစုေပါင္း(၂၂၃)ဦးကိုပညာအေမြေပးေနတဲ့မိဘမဲ့ေက်ာင္းေလးျဖစ္ပါသည္။ကိုယ္တိုင္သြားေရာက္လွဴဒါန္းလိုေသာ္လည္းအေၾကာင္းအမ်ိဳးမ်ိဳးေတြေၾကာင့္အခက္အခဲ"
                        +"ျဖစ္ေနၾကေသာေစတနာရွင္မိဘျပည္သူမ်ားအေနနဲ႔ ဆရာေတာ္အရွင္သုမန (ဖုန္း-0943156632 နဲ႔တုိက္႐ိုက္ဆက္သြယ္ၿပီးလွဴဒါန္းႏိုင္ေစရန္အတြက္ဆရာေတာ္အရွင္သုမနမွတ္ပံုတင္-"
                        +"၇/ကပက(သ)၀၀၁၁၄၃ျဖင့္လည္းေကာင္း၊႐ိုးမဘဏ္အေကာင့္ No.4611500044-8ျဖင့္လည္းေကာင္းတိုက္႐ိုက္ေငြလႊဲႏိုင္ပါတယ္(ကေမၻာဇဘဏ္မ်ားလည္း"
                        +"ရွိပါသည္)။ကိုယ္တိုင္ကိုယ္က်သြားေရာက္လွဴဒါန္းေသာမိဘျပည္သူမ်ားအေနနဲ႔ ရန္ကုန္ မွႀကိဳ႕ပင္ေကာက္ၿမိဳ႕သို႔ကားျဖင့္၄နာရီ ၾကာမည္ျဖစ္ၿပီးျပည္ၿမိဳ႕မွကားျဖင့္လာလွ်င္လည္း၄နာရီခန္႔ၾကာမည္"
                        +"ျဖစ္ပါသည္။ႀကိဳ႕ ပင္ေကာက္ၿမိဳ႕သည္ရန္ကုန္-ျပည္ကားလမ္း၊ ရထားလမ္း ေပၚတြင္တည္ရွိပါသည္။ႀကိဳ႕ပင္ေကာက္ၿမိဳ႕မွ သခၤ႐ိုင္မိဘမဲ့ေက်ာင္းသည္ ၁၈မိုင္ခန္႔ကြာေ၀းပါသည္။ၿမိဳ႕၏အေရွ႕ဘက္"
                        +"ျခမ္းတြင္တည္ရွိပါသည္။"));

        placeVOList.add(new PlaceVO("လိုတရ ကိုယ္ထူကိုယ္ထ မိဘမဲ့ဘုန္းေတာ္ႀကီးေက်ာင္း",
                "ရန္ကုန္တုိင္းေဒသႀကီး",
                "ေအာင္သုခ(၃)လမ္း၊ တ-၁၅ ရပ္ကြက္၊ ပန္းၿခံ(၂၈)၊ ေလွာ္ကား ကားဂိတ္ေအာက္(၁၂၄)အလြန္၊ ေရႊျပည္သာၿမိဳ႕နယ္။ ",
                "09-73226122,09-250031948",
                "၂သိန္း",
                "၇၅",
                "လက္ရွိေက်ာင္းတြင္ မိဘမဲ့ကေလးေပါင္း(၇၅)ဦးကို ျပဳစုေကၽြးေမြးေစာင့္ေရွာက္ ထားပါသည္။ အဆိုပါ ကေလးငယ္မ်ားမွာ ရွမ္းျပည္နယ္ နမ့္ခမ္းၿမိဳ႕နယ္အတြင္းမွ တိုင္းရင္းသားကေလးငယ္မ်ား"
                        +" ျဖစ္ၾကပါသည္။ ကေလးငယ္ (၇၅)ဦး တြင္ကိုရင္ငယ္ေလးမ်ားပါ၀င္ပါသည္။ ကေလးငယ္မ်ားအားအာဟာရေကၽြးေမြးမႈမွာ နံနက္ခင္းစာအတြက္ ၅ေသာင္းက်ပ္၊ ေန႔လည္စာအတြက္ ၁သိန္း၂ ေသာင္း"
                        +"က်ပ္ႏွင့္ ညေနစာအတြက္ ၃ေသာင္းက်ပ္ကုန္က်ၿပီးတစ္ေန႔တာအတြက္၂သိန္းက်ပ္ကုန္က် ပါသည္။ကေလးငယ္မ်ားကိုေက်ာင္းတြင္ပညာသင္ၾကားေပးႏိုင္ျခင္းမရွိေသးေသာ္လည္းအနီးရွိေက်ာင္း"
                        +"မ်ားတြင္ပညာသင္ၾကားေစလ်က္ရွိပါသည္။ကေလးငယ္မ်ားအတြက္အိပ္ေဆာင္၊စာသင္ေဆာင္မ်ားေဆာက္လုပ္ၿပီးပါကေက်ာင္းတြင္သာပညာသင္ၾကားႏိုင္မည္ျဖစ္ပါသည္။ထို႔အျပင္ေန႔စဥ္အခက္အခဲရွိေနသည္မွာကေလး"
                        +"ငယ္မ်ားအတြက္စားေသာက္ေရးအခက္အခဲရွိေနပါသည္။အဆိုပါေက်ာင္းတည္ေနရာကိုလူသိနည္းပါးသျဖင့္အလွဴရွင္မ်ားလာေရာက္လွဴဒါန္းမႈ နည္းပါးျခင္းေၾကာင့္ ျဖစ္ပါသည္။"));

        placeVOList.add(new PlaceVO("ဓမၼဒါနသစ္ပင္ငယ္ေက်ာင္းတုိက္၊ အပယ္ခံကေလးသူငယ္ေစာင့္ေရွာက္ေရးေဂဟာ",
                "က်ဳံမေငးျမိဳ႕",
                "ဝါးခယ္မျမိဳ႕နယ္ က်ဳံမေငးျမိဳ႕ ေရလည္ကၽြန္းေက်းရြာ ကၽြန္းဦး",
                "09-401527399",
                " - ",
                "၂၀",
                "၂၀၁၄ခုႏွစ္၂ လပုိင္းစတင္တည္ေထာင္ခဲ့ပါသည္။ လာေရာက္နားခိုေနသူ အပယ္ခံကေလးငယ္စာရင္းမွာ မိဘမဲ႕ က်ား ၁၄ မ ၄ (ေက်ာင္းတက္) စကားမေျပာတတ္ ကုိယ္လက္အဂၤါခ်ိဳ႕တဲ့ေနသူ၁ဦး ၊ AIDS ေရာဂါသည္ "
                        +"တစ္ဦး စုစုေပါင္း - ၂၀ ဦး ရွိပါသည္။ "));

        placeVOList.add(new PlaceVO("သုခရိပ္ၿမံဳ မိဘမဲ့ ေဂဟာ",
                "ရန္ကုန္တုိင္းေဒသႀကီး",
                " အမွတ္ ၉၇၉-၉၇၈၊ တပင္ေရႊထီးလမ္း ၊ (၁၁)ရပ္ကြက္၊ ေျမာက္ဒဂံု ။",
                "01-581955",
                " - ",
                "၁၁၅",
                "HIVျဖစ္ေနေသာကေလးငယ္မ်ားကိုျပဳစု ေစာင့္ေရွာက္ေနေသာ မိဘမဲ့ေဂဟာျဖစ္ပါသည္။ကေလးငယ္(၁၁၅)ဦးရွိပါသည္။အလြန္သနားစရာေကာင္းေသာမိဘမဲ့ကေလးငယ္ေလးမ်ားျဖစ္ပါသည္။"));

        placeVOList.add(new PlaceVO("ကေလးျပဳစုေရးေဂဟာ",
                "ရန္ကုန္တုိင္းေဒသႀကီး",
                "ေရႊဂံုတိုင္၊ ရန္ကုန္ၿမိဳ႕။ ",
                " 01-558450",
                "၁သိန္း ၂ေသာင္း",
                "၉၂",
                "ကေလးငယ္လသားကေန၈ႏွစ္ထိရိိွၿပီးအားလံုးမွာမိဘမဲ႔ ကေလးမ်ားျဖစ္ၾက ပါသည္။မိဘမဲ့ကေလးငယ္ ၉၂ေယာက္ရွိပါသည္။ေန႔စဥ္ ထမင္းေကၽြးေမြးစရိတ္မွာ ထမင္းတစ္နပ္လွ်င္ ၅"
                        +" ေသာင္းကုန္က်မည္ ျဖစ္ပါသည္။ တစ္ေန႔စာအတြက္ ေကၽြးေမြးကုန္က်စရိတ္မွာ၁သိန္း ၂ ေသာင္း ခန္႔ကုန္က်မည္ ျဖစ္ပါသည္။ "));


        return placeVOList;
    }

    public static List<PlaceVO> assignNursingHomeData() {
        List<PlaceVO> placeVOList = new ArrayList<>();

        placeVOList.add(new PlaceVO("မဟာေဗာဓိ YGWပရဟိတမိဘမဲ့ေက်ာင္း",
                "ရန္ကုန္တိုင္းေဒသႀကီး",
                "သနပ္ေခ်ာင္းေက်းရြာ၊ တိုက္ႀကီးၿမိဳ႕နယ္။ ",
                "09-796809759,09-797618643",
                " - ",
                "၈၂",
                "အဆိုပါေက်ာင္းသည္ရန္ကုန္ၿမိဳ႕မွျပည္ၿမိဳ႕ဘက္မွလာလွ်င္ တိုက္ၾကီးၿမိဳ႕အေက်ာ္ ဖလံ(ဥတိုတာဆံု)မွ ညာဘက္လမ္းခြဲသို႔ ၀င္ေရာက္ရၿပီး ၁၅မိနစ္ခန္႔ကားစီး၍ ၀င္ရေၾကာင္းသိရွိရပါသည္။"
                        + "မိုးတြင္းကာလတြင္ကားလမ္းမွာေျမသားလမ္းျဖစ္သျဖင့္ အနည္းငယ္အခက္အခဲရွိပါသည္။ ေက်ာင္းမွာယခုပညာသင္ႏွစ္မွစတင္၍ ကေလးငယ္မ်ားကိုပညာသင္ၾကားေပးမည္ျဖစ္ပါသည္။လ"
                        + "က္ရွိေက်ာင္းတြင္ရွမ္းျပည္နယ္နမ့္ခမ္းၿမိဳ႕နယ္ဘက္မွမိဘမဲ့ကေလး(၁၂)ဦးအပါအ၀င္ေက်ာင္းအိပ္ေက်ာင္းစားကေလးငယ္(၇၀)ေက်ာ္ကိုျပဳစုေစာင့္ေရွာက္ေကၽြးေမြးပညာ"
                        + "သင္ၾကားေပးလ်က္ရွိပါသည္။ပညာသင္ၾကားမႈအေနျဖင့္သူငယ္တန္းမွ၁၀တန္းအထိေက်ာင္းအိပ္ေက်ာင္းစားကေလးငယ္မ်ားအပါအ၀င္အနီးအနားရွိဆင္းရဲခ်ိဳ႕တဲ့ကေလးငယ္၁၈၀ေက်ာ္"
                        + "ကိုပါဆရာ၊ဆရာမ၁၅ဦးျဖင့္အခမဲ့ပညာသင္ၾကားေပးသြားမည္ျဖစ္ေၾကာင္းသိရွိရပါသည္။လက္ရွိတြင္ေက်ာင္းမွာအသစ္ျဖစ္ျခင္းေၾကာင့္လိုအပ္ခ်က္မ်ားစြာရွိေနပါသည္။ကေလး"
                        + "ငယ္မ်ားအတြက္အိပ္ေဆာင္မ်ား၊ထမင္းစားေဆာင္၊အ၀တ္အထည္မ်ား၊စာေရးကိရိယာမ်ား၊သင္ေထာက္ကူပစၥည္းမ်ားႏွင့္အမ်ိဳးသမီးအသံုးအေဆာင္ပစၥည္းမ်ားလည္းလိုအပ္လ်က္ရွိေနပါသည္။"
                        + "လက္ရွိတြင္ အမ်ိဳးသမီးငယ္(၃၅)ဦး ရွိပါသည္။"));
        return placeVOList;
    }

    public static List<PlaceVO> assignOfflineData(){
        List<PlaceVO> placeVOList = new ArrayList<>();
        int i = 0;

        for(PlaceVO placeVO : assignOrphanData()){
            placeVO.setId(i+"");
            placeVOList.add(placeVO);
            i++;
        }
        return placeVOList;
    }
}
